{"articles":[{"title":"Anastasia’s John Bolton and Caroline O’Connor Are Part of Free Broadway in the Boros Concert July 21","urlTitle":"Anastasia%E2%80%99s%20John%20Bolton%20and%20Caroline%20O%E2%80%99Connor%20Are%20Part%20of%20Free%20Broadway%20in%20the%20Boros%20Concert%20July%2021","author":"Andrew Gans","body":"Broadway in the Boros, the series of free musical performances featuring stars from some of Broadway’s most popular shows, continues July 21 in Queens' Socrates Sculpture Park.\\nPresented by the Mayor's Office of Media and Entertainment, the noon performance features cast members of Anastasia—including John Bolton and Caroline O’Connor—as well as cast members of The Great Comet, including Kennedy Caughell, Ashley Peréz Flanagan, and Shoba Narayan."},{"title":"Eggs Are Good","titleUrl":"Eggs%Are%Good","author":"John Atkins","body":"Eggs are really good, whether fried over-easy or sunny-side up, or scrambled, or poached, or hard-boiled, or soft-boiled, or raw."},{"title":"xxx","titleUrl":"xxx","author":"W.R. Hearst","body":"The granddaughter of 19th century media mogul William Randolph Hearst, Patty Hearst was kidnapped by the Symbionese Liberation Army in 1974. She spent 19 months with her captors—joining them in criminal acts soon after her kidnapping—before she was captured by the FBI."},{"title":"Dog Sees God","titleUrl":"Dog%20Sees%20God","author":"Anna Manna","body":"A Florida family was jolted awake in the wee hours Saturday morning, startled to find that 15 pounds of frozen meat had crashed onto their roof.  “It was like thunder, and it awakened me out of a sleep,” Travis Adair told WPLG.  When family members went outside to investigate, they found two packages of frozen Italian pork sausage in the side yard of their Deerfield Beach home, and three more on the roof. Adair told The Associated Press that the meat sacks must have fallen from above, since they were too heavy to have been thrown onto the roof from the ground. His’ wife, Jennie Adair, speculated the meat fell from a plane, and may have related to a “drug deal.”"},{"title":"Sessions discussed Trump campaign with Russian ambassador, per intel intercepts","urlTitle":"Sessions%20discussed%20Trump%20campaign%20with%20Russian%20ambassador,%20per%20intel%20intercepts","author":"Miranda Green","body":"Attorney General Jeff Sessions met with the Russian Ambassador to the US Sergey Kislyak to discuss Trump campaign matters during the 2016 presidential election, according to US intelligence intercepts, The Washington Post reports.  According to the Post, Kislyak told his superiors in Moscow about two conversations he had with Sessions, which included a discussion on policy issues important to the Kremlin. Sessions was a foreign policy adviser to Trump and major campaign supporter at the time. Sessions originally never disclosed any interactions he had with Kislyak, but a meeting first came to light in March when the Post reported that he met with Kislyak at an event during the Republican National Convention in Cleveland. Sessions met with Kislyak for a second time during the presidential campaign, this time in his Senate office in Washington. This meeting, in September, also wasn't publicly known until the Post reported about it in March."},{"title":"Mueller asks WH staff to preserve all documents relating to June 2016 meeting","urlTitle":"Mueller%20asks%20WH%20staff%20to%20preserve%20all%20documents%20relating%20to%20June%202016%20meeting","author":"Dana Bash","body":"Special counsel Robert Mueller has asked the White House to preserve all documents relating to the June 2016 meeting at Trump Tower that Donald Trump Jr., Jared Kushner and Paul Manafort had with a Russian lawyer and others, according to a source who has seen the letter.  Mueller sent a notice, called a document preservation request, asking White House staff to save \"any subjects discussed in the course of the June 2016 meeting\" and also \"any decisions made regarding the recent disclosures about the June 2016 meeting,\" according to the source, who read portions of the letter to CNN. The letter from Mueller began: \"As you are aware the Special Counsel's office is investigating the Russian government's efforts to interfere in the 2016 presidential election, including any links or coordination between the Russian government and individuals associated with the campaign of Donald Trump. Information concerning the June 2016 meeting between Donald J Trump Jr and Natalia Veselnitskaya is relevant to the investigation.\" Trump reshuffling legal team Trump reshuffling legal team The preservation request is broad and includes text messages, emails, notes, voicemails and other communications and documentation regarding the June 2016 meeting and any related communication since then. On Wednesday, the White House counsel's office sent a notice to White House staff informing them of the document preservation request. A second source confirmed to CNN the letter was sent to White House personnel. Such notices are frequently sent in the early stages of investigation and puts those who receive it on notice of the need to hold on to the material and specifically not to destroy documents that could be relevant to the investigation and requested in the future."},{"title":"Hundreds of German choir boys allegedly abused, report says","urlTitle":"Hundreds%20of%20German%20choir%20boys%20allegedly%20abused,%20report%20says","author":"Ben Wescott","body":"As many as 547 former students of the Catholic Regensburger Domspatzen choir school in Germany were abused physically, and in some cases sexually, over a period of 70 years, an independent report has alleged.\r\n\r\nThe 440-page report, commissioned by the Regensburg diocese, found a culture of violence across the school, from pre-school classes, for children aged from 8 to 11, to boarding houses for older children, allegedly committed from 1945 until the report was commissioned in 2015.\r\n\"Pre-school victims of the Regensburg Domspatzen in (the towns of) Etterzhausen and Pielenhofen described the institution as a prison, hell and a concentration camp,\" the report's co-author lawyer Ulrich Weber said at a press conference Tuesday."}]}